In [2]:
# Exp No :7
#Aim: To perform Operation Of Simple Linear Regression.
#Name:Shrutika Mehare
#Roll No.:39
#Sec:B
#Subject:ET 1
#Date:04/09/2025

# Aim: To perform Operation Of Simple Linear Regression.

In [ ]:
import pandas as pd

In [11]:
import os

In [12]:
os.getcwd()

'C:\\Users\\lokes'

In [13]:
os.chdir('C:\\Users\\lokes\\OneDrive\\Desktop')

In [14]:
df=pd.read_csv("Salary_Data - Salary_Data.csv")

In [15]:
df.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [16]:
df.shape

(30, 2)

In [17]:
df.size

60

In [18]:
df.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [19]:
df.tail()

    YearsExperience  Salary
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872

In [20]:
df.ndim

2

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  30 non-null     float64
 1   Salary           30 non-null     int64
dtypes: float64(1), int64(1)
memory usage: 608.0 bytes

In [22]:
df.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

In [23]:
df.isna()

    YearsExperience  Salary
0             False   False
1             False   False
2             False   False
3             False   False
4             False   False
5             False   False
6             False   False
7             False   False
8             False   False
9             False   False
10            False   False
11            False   False
12            False   False
13            False   False
14            False   False
15            False   False
16            False   False
17            False   False
18            False   False
19            False   False
20            False   False
21            False   False
22            False   False
23            False   False
24            False   False
25            False   False
26            False   False
27            False   False
28            False   False
29            False   False

In [24]:
df.isna().any()

YearsExperience    False
Salary             False
dtype: bool

In [25]:
df.isna().sum()

YearsExperience    0
Salary             0
dtype: int64

# Independent and Dependent Variables

In [26]:
x=df.drop('Salary',axis=1)

In [27]:
x.head()

   YearsExperience
0              1.1
1              1.3
2              1.5
3              2.0
4              2.2

In [28]:
y=df.Salary

In [29]:
y.head()

0    39343
1    46205
2    37731
3    43525
4    39891
Name: Salary, dtype: int64

In [30]:
from sklearn.model_selection import train_test_split

In [31]:
x_train,x_test,y_train,y_test=train_test_split(x,y,random_state=0,test_size=0.30)

In [32]:
print(x_train.shape)

(21, 1)

In [33]:
x_test.shape

(9, 1)

# Model Fitting

In [34]:
from sklearn.linear_model import LinearRegression
LR=LinearRegression()
LR.fit(x_train,y_train)

LinearRegression()

In [35]:
#Assigning Coefficient (slope) to m
m= LR.coef_

In [36]:
print("Coefficient :" ,m)

Coefficient : [9360.26128619]

In [37]:
#Assignment Y-intercept to a
c = LR.intercept_

In [38]:
print("Intercept :", c)

Intercept : 26777.391341197632

# Evaluation metrics

In [39]:
from sklearn import metrics

# Accuracy

In [41]:
Accuracy = LR.score(x_test, y_test)
Accuracy

0.9740993407213511